zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_csd_v2.c
    /* Connection AMUXBUS-A to CSDBUS-A / AMUXBUS-B to CSDBUS-B */
    context->ptrCommonConfig->ptrCsdBase->SW_BYP_SEL = context->ptrInternalContext->csdRegSwBypSel;

    /* Connect CMOD to AMUXBUS-A */
    interruptState = Cy_SysLib_EnterCriticalSection();
    Cy_GPIO_SetDrivemode((GPIO_PRT_Type*)context->ptrCommonConfig->portCmod, (uint32_t)context->ptrCommonConfig->pinCmod, CY_CAPSENSE_DM_GPIO_ANALOG);
    Cy_GPIO_SetHSIOM((GPIO_PRT_Type*)context->ptrCommonConfig->portCmod, (uint32_t)context->ptrCommonConfig->pinCmod, CY_CAPSENSE_HSIOM_SEL_AMUXA);
    Cy_SysLib_ExitCriticalSection(interruptState);

    /* Select CMOD and Csh_tank/shield initialization switch resistance */
    context->ptrCommonConfig->ptrCsdBase->SW_RES = context->ptrInternalContext->csdRegSwResScan;
    /* Set the number of dummy fine initialization cycles */
    context->ptrCommonConfig->ptrCsdBase->SEQ_INIT_CNT = (uint32_t)context->ptrCommonConfig->csdFineInitTime;

    /* Connect CMOD to (sense path) to CSDCOMP */
    context->ptrCommonConfig->ptrCsdBase->SW_CMP_P_SEL = context->ptrInternalContext->csdRegSwCmpPSel;

    /* Configure VREF */
    context->ptrCommonConfig->ptrCsdBase->SW_REFGEN_SEL = context->ptrInternalContext->csdRegSwRefGenSel;
    context->ptrCommonConfig->ptrCsdBase->AMBUF = context->ptrInternalContext->csdRegAmuxbufInit;

    /* Connect VREFHI to HSCOMP */
    context->ptrCommonConfig->ptrCsdBase->SW_HS_N_SEL = CY_CAPSENSE_CSD_SW_HS_N_SEL_SW_HCRH_STATIC_CLOSE;
    context->ptrCommonConfig->ptrCsdBase->SW_CMP_N_SEL = context->ptrInternalContext->csdRegSwCmpNSel;
    context->ptrCommonConfig->ptrCsdBase->REFGEN = context->ptrInternalContext->csdRegRefgen;

    /* Configure IDACs mode */
    context->ptrCommonConfig->ptrCsdBase->IDACA = context->ptrInternalContext->csdIdacAConfig;
    context->ptrCommonConfig->ptrCsdBase->IDACB = context->ptrInternalContext->csdIdacBConfig;
    context->ptrCommonConfig->ptrCsdBase->CONFIG = context->ptrInternalContext->csdRegConfig;

    /* Configure ModClk */
    Cy_CapSense_SetClkDivider((uint32_t)context->ptrCommonContext->modCsdClk - 1u, context);

    /* Set all sensor states to the defined ISC state */
    Cy_CapSense_SetIOsInDesiredState(context->ptrInternalContext->csdInactiveSnsDm, 0u,
                                     context->ptrInternalContext->csdInactiveSnsHsiom, context);

    /* Setup ISR handler to single-sensor scan function */
    context->ptrInternalContext->ptrISRCallback = &Cy_CapSense_CSDScanISR;

    context->ptrActiveScanSns->mfsChannelIndex = 0u;
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSDSnsStateCheck
****************************************************************************//**
*
* Checks if electrodes were previously connected using
* Cy_CapSense_CSDSetupWidgetExt() and if yes disconnects them.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSDSnsStateCheck(cy_stc_capsense_context_t * context)
{
    if (CY_CAPSENSE_SNS_CONNECTED == context->ptrActiveScanSns->connectedSnsState)
    {
        Cy_CapSense_CSDDisconnectSnsExt(context);
    }
}

/*******************************************************************************
* Function Name: Cy_CapSense_CSDSetUpIdacs
****************************************************************************//**
*
* This function writes both IDACs available in CSD method into corresponding
* the CSD HW block registers.
*
* Modulator IDAC is taken from widget context structure and Compensation
* IDAC is taken from sensor context structure.
* The cy_stc_capsense_active_scan_sns_t structure must be updated to the current
* widget/sensor by Cy_CapSense_InitActivePtr() before calling this function.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSDSetUpIdacs(cy_stc_capsense_context_t * context)
{
    uint32_t regValue;

    const cy_stc_capsense_active_scan_sns_t * ptrActive = context->ptrActiveScanSns;

    const uint32_t idacaBitsToWrite = CSD_IDACA_VAL_Msk |
                                      CSD_IDACA_RANGE_Msk |
                                      CSD_IDACA_LEG1_EN_Msk |
                                      CSD_IDACA_LEG2_EN_Msk;

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_IDAC_COMP_EN)
        const uint32_t idacbBitsToWrite = CSD_IDACB_VAL_Msk     |
                                          CSD_IDACB_RANGE_Msk   |
                                          CSD_IDACB_LEG1_EN_Msk |
                                          CSD_IDACB_LEG2_EN_Msk |
                                          CSD_IDACB_LEG3_EN_Msk;
    #endif

    /* IDAC A Code */
    if (ptrActive->ptrWdConfig->numCols > ptrActive->sensorIndex)
    {
        regValue = ptrActive->ptrWdContext->idacMod[ptrActive->mfsChannelIndex];
    }
    else
    {
        regValue = ptrActive->ptrWdContext->rowIdacMod[ptrActive->mfsChannelIndex];
    }

    regValue |= context->ptrCommonConfig->idacGainTable[ptrActive->ptrWdContext->idacGainIndex].gainReg;

    context->ptrCommonConfig->ptrCsdBase->IDACA =
            (context->ptrCommonConfig->ptrCsdBase->IDACA & ~idacaBitsToWrite) |
            (regValue & idacaBitsToWrite);

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_IDAC_COMP_EN)
        /* IDAC B Code */
        regValue = ptrActive->ptrSnsContext->idacComp;
        regValue |= context->ptrCommonConfig->idacGainTable[ptrActive->ptrWdContext->idacGainIndex].gainReg;

        context->ptrCommonConfig->ptrCsdBase->IDACB =
                (context->ptrCommonConfig->ptrCsdBase->IDACB & ~idacbBitsToWrite) |
                (regValue & idacbBitsToWrite);
    #endif
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSDGetNumberOfConversions
****************************************************************************//**
*
* This function calculate number of sub-conversions.
*
* \param snsClkDivider
* The divider value of the sense clock.
*
* \param resolution
* The widget resolution.
*
* \param snsClkSrc
* The widget Sense Clock Source.
*
* \return
* Returns the number of sub-conversions.
*
*******************************************************************************/
uint32_t Cy_CapSense_CSDGetNumberOfConversions(uint32_t snsClkDivider, uint32_t resolution, uint32_t snsClkSrc)
{
    /* CY_ID304273 */
    uint32_t conversionsNum = 1uL << resolution;
    uint32_t extraCounts = 0u;
    uint32_t snsClkDividerLocal = snsClkDivider;

