zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_csd_v2.c
    /* Disconnect previous sensors if they have been connected */
    Cy_CapSense_CSDSnsStateCheck(context);

    /* Save widget Id to have assess to it after scanning  */
    Cy_CapSense_InitActivePtr(widgetId, 0u, context);

    /*
     * Configuring the Sense Clock and the Scan Duration if the
     * MFS feature is disabled, and the one-dimension widget will be scanned.
     * If the MFS feature is enabled, or the two-dimension widget will be scanned,
     * the Sense Clock and the Scan Duration will be configured for each call
     * of the Cy_CapSense_CSDScan() function.
     */
    #if (CY_CAPSENSE_DISABLE == CY_CAPSENSE_MULTI_FREQUENCY_SCAN_EN)
        #if ((CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_MATRIX_EN) ||\
            (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_TOUCHPAD_EN))
            ptrWdCfg = context->ptrActiveScanSns->ptrWdConfig;
            if (((uint8_t)CY_CAPSENSE_WD_TOUCHPAD_E != ptrWdCfg->wdType) &&
               ((uint8_t)CY_CAPSENSE_WD_MATRIX_BUTTON_E != ptrWdCfg->wdType))
            {
                Cy_CapSense_CSDCalculateScanDuration(context);
                Cy_CapSense_CSDConfigClock(context);
            }
        #else
            Cy_CapSense_CSDCalculateScanDuration(context);
            Cy_CapSense_CSDConfigClock(context);
        #endif
    #endif
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSDSetupWidgetExt
****************************************************************************//**
*
* Performs extended initialization required to scan a specified sensor in
* a widget using CSD sensing method.
*
* \deprecated This function is obsolete and kept for backward compatibility only.
* The Cy_CapSense_SetupWidgetExt() function should be used instead.
*
* This function performs the same tasks of Cy_CapSense_CSDSetupWidget() and
* also connects and configures specified sensor for scan. Hence this
* function, along with Cy_CapSense_CSDScanExt() function, can be used to
* scan a specific sensor in the widget.
*
* This function should be called for widget that is configured to use
* CSD sensing method, using this function on a non-CSD sensing widget
* would cause unexpected result.
*
* This function requires using the Cy_CapSense_CSDScanExt() function to
* initiate a scan.
*
* Calling this function directly from the application layer is not
* recommended. This function is used to implement only the user's
* specific use cases (for example faster execution).
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param sensorId
* Specifies the ID number of the sensor within the widget. A macro for the
* sensor ID within a specified widget can be found in the cycfg_capsense.h
* file defined as CY_CAPSENSE_<WIDGET_NAME>_SNS<SENSOR_NUMBER>_ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSDSetupWidgetExt(uint32_t widgetId, uint32_t sensorId, cy_stc_capsense_context_t * context)
{
    /* Switch Mode if needed */
    (void)Cy_CapSense_SwitchSensingMode(CY_CAPSENSE_CSD_GROUP, context);

    /* Disconnect previous sensors if they have been connected */
    Cy_CapSense_CSDSnsStateCheck(context);
    Cy_CapSense_InitActivePtr(widgetId, sensorId, context);

    /*
    * Set up of the Sense Clock, the Scan Duration and the IDACs
    * if the MFS feature is disabled.
    * If the MFS feature is enabled, the Sense Clock, the
    * Scan Duration and the IDACs will be configured with the
    * MFS channel #0 settings each call of the Cy_CapSense_CSDScan()
    * function.
    */
    #if (CY_CAPSENSE_DISABLE == CY_CAPSENSE_MULTI_FREQUENCY_SCAN_EN)
        Cy_CapSense_CSDSetUpIdacs(context);
        Cy_CapSense_CSDCalculateScanDuration(context);
        Cy_CapSense_CSDConfigClock(context);
    #endif

    /* Setup new widget/sensor */
    Cy_CapSense_CSDConnectSnsExt(context);
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSDStartSample
****************************************************************************//**
*
* Starts the CSD conversion.
*
* This function assumes that the CSD HW block is already set up using
* the Cy_CapSense_CSDSetupWidget() and the sensor port-pin is connected to the CSD
* block using Cy_CapSense_CSDConnectSns().
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSDStartSample(cy_stc_capsense_context_t * context)
{
    /* Force the LFSR BITS to default before callback, so they can be changed */
    context->ptrCommonConfig->ptrCsdBase->SENSE_PERIOD |= CY_CAPSENSE_CSD_SENSE_PERIOD_LFSR_BITS_MSK;

    if (NULL != context->ptrInternalContext->ptrSSCallback)
    {
        context->ptrInternalContext->ptrSSCallback(context->ptrActiveScanSns);
    }

    /* Precharging Cmod and Csh */
    Cy_CapSense_CSDCmodPrecharge(context);

    /* Trigger Scan */
    Cy_CapSense_CSDTriggerScan(context);
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSDScanExt
****************************************************************************//**
*
* Starts the CSD conversion on the preconfigured sensor.
*
* \deprecated This function is obsolete and kept for backward compatibility only.
* The Cy_CapSense_ScanExt() function should be used instead.
*
* This function performs scanning of a specific sensor in the widget
* previously initialized using the Cy_CapSense_CSDSetupWidgetExt() function.
*
* This function is called when no scanning is in progress.
* I.e. Cy_CapSense_IsBusy() returns a non-busy status and the widget must
* be preconfigured using Cy_CapSense_CSDSetupWidgetExt() function prior
* to calling this function. Calling this function directly from
* the application program is not recommended. This function is used to
* implement only the user's specific use cases (for example faster execution).
*
* This function does not disconnect sensor GPIOs from CSD HW block at the
* end of a scan, therefore making subsequent scan of the same sensor is faster.
* If sensor needs to be disconnected after the scan,
* Cy_CapSense_CSDDisconnectSns() function can be used.
*
* Calling Cy_CapSense_SetupWidget(), Cy_CapSense_CSDSetupWidget(),
* Cy_CapSense_ScanAllWidgets(), or if Cy_CapSense_RunTuner() returns
* CY_CAPSENSE_STATUS_RESTART_DONE status invalidated initialization
* made by this function.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSDScanExt(cy_stc_capsense_context_t * context)
{
    cy_stc_capsense_active_scan_sns_t * ptrActive = context->ptrActiveScanSns;

