zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_csd_v2.c
    /* Set MFS channel index to 0 */
    ptrActive->mfsChannelIndex = 0u;

    /* Initialize the Active Context pointer with the CH0 context */
    ptrActive->ptrSnsContext = &ptrActive->ptrWdConfig->ptrSnsContext[ptrActive->sensorIndex];

    /* Set Start of sensor scan flag */
    Cy_CapSense_SetBusyFlags(context);

    /* Set scope flag */
    ptrActive->scanScope = CY_CAPSENSE_SCAN_SCOPE_SNGL_SNS;

    /*
    * Configuring of the Sense Clock, the Scan Duration and
    * the IDACs with the MFS channel #0 settings if the MFS
    * feature is enabled.
    * If the MFS feature is disabled, the Sense Clock, the
    * Scan Duration and the IDACs are configured only once
    * in scope of the Cy_CapSense_CSDSetupWidgetExt() function.
    */
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_FREQUENCY_SCAN_EN)
        Cy_CapSense_CSDSetUpIdacs(context);
        Cy_CapSense_CSDCalculateScanDuration(context);
        Cy_CapSense_CSDConfigClock(context);
    #endif

    /* Initiate scan */
    Cy_CapSense_CSDStartSample(context);
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSDScan
****************************************************************************//**
*
* This function initiates a scan for the sensors of the widget initialized
* by the Cy_CapSense_CSDSetupWidget() function.
*
* \deprecated This function is obsolete and kept for backward compatibility only.
* The Cy_CapSense_Scan() function should be used instead.
*
* This function does the following tasks:
* 1. Connects the first sensor of the widget.
* 2. Configures the IDAC value.
* 3. Starts scanning for the first sensor in the widget.
*
* This function is called by the Cy_CapSense_Scan() if the given
* widget uses the CSD sensing method.
*
* Calling this function directly from the application program is not
* recommended. This function is used to implement only the user's specific
* use cases (for example faster execution).
*
* This function is called when no scanning is in progress. I.e.
* Cy_CapSense_IsBusy() returns a non-busy status and the widget must be
* preconfigured using the Cy_CapSense_CSDSetupWidget() function prior
* to calling this function.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSDScan(cy_stc_capsense_context_t * context)
{
    #if ((CY_CAPSENSE_DISABLE == CY_CAPSENSE_MULTI_FREQUENCY_SCAN_EN) &&\
        ((CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_MATRIX_EN) ||\
         (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_TOUCHPAD_EN)))
        const cy_stc_capsense_widget_config_t * ptrWdCfg;
    #endif

    Cy_CapSense_InitActivePtrSns(0u, context);

    /* Setup Idac Value */
    Cy_CapSense_CSDSetUpIdacs(context);
    /*
    * Configuring the Sense Clock and the Scan Duration with the settings of the
    * widget's Row, if the two-dimension widget is scanned and with the MFS channel #0
    * settings, if the MFS feature is enabled.
    * If the MFS feature is disabled and the one-dimension widget is scanned,
    * the Sense Clock and the Scan Duration will be configured only once in the scope
    * of the Cy_CapSense_CSDSetupWidget() function.
    */
    #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_MULTI_FREQUENCY_SCAN_EN)
        Cy_CapSense_CSDCalculateScanDuration(context);
        Cy_CapSense_CSDConfigClock(context);
    #elif ((CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_MATRIX_EN) ||\
          (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_TOUCHPAD_EN))
        ptrWdCfg = context->ptrActiveScanSns->ptrWdConfig;
        if (((uint8_t)CY_CAPSENSE_WD_TOUCHPAD_E == ptrWdCfg->wdType) ||
           ((uint8_t)CY_CAPSENSE_WD_MATRIX_BUTTON_E == ptrWdCfg->wdType))
        {
            Cy_CapSense_CSDCalculateScanDuration(context);
            Cy_CapSense_CSDConfigClock(context);
        }
    #endif

    Cy_CapSense_CSDConnectSnsExt(context);

    context->ptrActiveScanSns->scanScope |= CY_CAPSENSE_SCAN_SCOPE_ALL_SNS_MASK;

    /* Set Start of sensor scan flag */
    Cy_CapSense_SetBusyFlags(context);
    /* Initiate scan */
    Cy_CapSense_CSDStartSample(context);
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSDConnectSnsExt
****************************************************************************//**
*
* Connects a ganged sensor port-pin to the CSD HW block via the AMUX bus.
*
* The function gets the IO configuration registers addresses, their shifts and
* masks from the cy_stc_capsense_pin_config_t object. Based on this data, it
* updates the HSIOM and PC registers.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSDConnectSnsExt(cy_stc_capsense_context_t * context)
{
    cy_stc_capsense_active_scan_sns_t * ptrActive = context->ptrActiveScanSns;
    const cy_stc_capsense_electrode_config_t * ptrActiveSns = ptrActive->ptrEltdConfig;
    const cy_stc_capsense_pin_config_t * ptrActivePin = ptrActiveSns->ptrPin;
    uint32_t i;

    /* Connect all pins of current sensors */
    for (i = 0u; i < ptrActiveSns->numPins; i++)
    {
        Cy_CapSense_CSDConnectSns(ptrActivePin, context);
        ptrActivePin++;
    }
    ptrActive->connectedSnsState = CY_CAPSENSE_SNS_CONNECTED;
}


/*******************************************************************************
* Function Name: Cy_CapSense_CSDDisconnectSnsExt
****************************************************************************//**
*
* Disconnects a ganged sensor port-pin from the CSD HW block and AMUX bus.
* Sets the default state of the un-scanned sensor.
*
* The function gets the IO configuration registers addresses, their shifts and
* masks from the cy_stc_capsense_pin_config_t object. Based on this data and
* the Inactive sensor connection parameter, it updates the HSIOM, PC, and DR registers.
* The HSIOM register is updated only when the Inactive sensor connection parameter
* is set to Shield.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSDDisconnectSnsExt(cy_stc_capsense_context_t * context)
{
    cy_stc_capsense_active_scan_sns_t * ptrActive = context->ptrActiveScanSns;
    const cy_stc_capsense_electrode_config_t * ptrActiveSns = ptrActive->ptrEltdConfig;
    const cy_stc_capsense_pin_config_t * ptrActivePin = ptrActiveSns->ptrPin;

    uint32_t i;

