zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_csd_v2.c
    maxIdac = 0u;
    minIdac = CY_CAPSENSE_CAL_IDAC_MAX_VALUE;

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_IDAC_COMP_EN)
        const cy_stc_capsense_sensor_context_t * ptrSnsCxt;
        uint32_t snsIndex;
    #endif

    for (freqChIndex = 0u; freqChIndex < CY_CAPSENSE_CONFIGURED_FREQ_NUM; freqChIndex++)
    {
        /* Find maximum and minimum IDACs */
        idacVal = ptrActive->ptrWdContext->idacMod[freqChIndex];
        if (maxIdac < idacVal)
        {
            maxIdac = idacVal;
        }
        if (minIdac > idacVal)
        {
            minIdac = idacVal;
        }
        /* Check for sensorIndex >= numCols added and choose rowIdac if needed */
        #if ((CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_MATRIX_EN) || (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_TOUCHPAD_EN))
            if ((((uint8_t)CY_CAPSENSE_WD_TOUCHPAD_E == ptrActive->ptrWdConfig->wdType) ||
                 ((uint8_t)CY_CAPSENSE_WD_MATRIX_BUTTON_E == ptrActive->ptrWdConfig->wdType)) &&
                 (ptrActive->ptrWdConfig->numCols <= ptrActive->sensorIndex))
            {
                idacVal = ptrActive->ptrWdContext->rowIdacMod[freqChIndex];
                if (maxIdac < idacVal)
                {
                    maxIdac = idacVal;
                }
                if (minIdac > idacVal)
                {
                    minIdac = idacVal;
                }
            }
        #endif

        /* Set value for iDac comp */
        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_IDAC_COMP_EN)
            for (snsIndex = 0u; snsIndex < ptrActive->ptrWdConfig->numSns; snsIndex++)
            {
                ptrSnsCxt = &ptrActive->ptrWdConfig->ptrSnsContext[snsIndex];
                idacVal = ptrSnsCxt[freqChIndex * context->ptrCommonConfig->numSns].idacComp;
                if (minIdac > idacVal)
                {
                    minIdac = idacVal;
                }
            }
        #endif
    }

    /* Check gain switch conditions */
    if (gainIndex != 0u)
    {
        if (minIdac < context->ptrCommonConfig->csdIdacMin)
        {
            ratio = context->ptrCommonConfig->idacGainTable[gainIndex].gainValue /
                    context->ptrCommonConfig->idacGainTable[gainIndex - 1u].gainValue;
            if ((maxIdac * ratio) < CY_CAPSENSE_CAL_IDAC_MAX_VALUE)
            {
                /* Switch to lower idac gain */
                ptrActive->ptrWdContext->idacGainIndex--;
                swStatus = 1u;
            }
        }
    }
    return swStatus;
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_IDAC_AUTO_GAIN_EN) */


/*******************************************************************************
* Function Name: Cy_CapSense_CSDCalibrate
****************************************************************************//**
*
* Implements IDAC calibration for a desired widget using successive
* approximation algorithm.
*
* It supports any type of CSD widgets, and works
* with multi-frequency scan and compensation IDAC features enabled.
*
* As result of function operation, the modulator IDAC that corresponds to the
* sensor with the highest capacitance (the biggest modulator IDAC) is stored
* into widget data structure. If it is dual-axis widget type (touchpad or matrix
* buttons) or if multi-frequency scan feature is enabled then the maximum
* modulator IDAC found separately for each multi-frequency channel and for
* rows/columns.
*
* If compensation IDAC is enabled, then it preserves IDAC value of
* single-sensor calibration. In dual IDAC mode each sensor was calibrated with
* equal values of modulator and compensation IDAC.
*
* After IDACs were found each sensor scanned again to get real raw count stored
* in sensor structure.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param target
* Specifies the calibration target in percentages of the maximum raw count.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_CSDCalibrate(
                uint32_t widgetId,
                uint32_t target,
                cy_stc_capsense_context_t * context)
{
    uint32_t freqChIndex;
    uint32_t snsIndex;
    uint32_t rawTarget;
    uint32_t modClkDivider;
    uint32_t cpuFreqMHz;
    uint32_t watchdogCounter;

    uint8_t calMask;
    uint8_t * ptrIdacMod;
    uint8_t * ptrIdacMax;
    uint8_t maxColIdac[CY_CAPSENSE_MAX_SUPPORTED_FREQ_NUM] = {0u, 0u, 0u};
    uint8_t maxRowIdac[CY_CAPSENSE_MAX_SUPPORTED_FREQ_NUM] = {0u, 0u, 0u};

    cy_stc_capsense_widget_config_t const * ptrWdCfg = &context->ptrWdConfig[widgetId];
    cy_stc_capsense_widget_context_t * ptrWdCxt = ptrWdCfg->ptrWdContext;
    cy_stc_capsense_sensor_context_t * ptrSnsCxt;

    #if (((CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_MATRIX_EN) || (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_TOUCHPAD_EN)) &&\
         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_IDAC_ROW_COL_ALIGN_EN))
        uint32_t tmpVal;
    #endif

    /* Approximate duration of Wait For Init loop */
    const uint32_t isBusyLoopDuration = 5uL;

    /* Wait For Init watchdog timeout in microseconds */
    uint64_t isBusyWatchdogTimeUs = 0u;

    rawTarget = ((uint32_t)ptrWdCxt->maxRawCount * target) / CY_CAPSENSE_PERCENTAGE_100;

    for (snsIndex = 0u; snsIndex < (uint32_t)ptrWdCfg->numSns; snsIndex++)
    {
        /* Set default IDAC code */
        calMask = (uint8_t)CY_CAPSENSE_CAL_MIDDLE_VALUE;
        ptrSnsCxt = &ptrWdCfg->ptrSnsContext[snsIndex];


        if (ptrWdCfg->numCols > snsIndex)
        {
            ptrIdacMod = ptrWdCxt->idacMod;
            ptrIdacMax = maxColIdac;
        }
        else
        {
            ptrIdacMod = ptrWdCxt->rowIdacMod;
            ptrIdacMax = maxRowIdac;
        }

        for (freqChIndex = 0u; freqChIndex < CY_CAPSENSE_CONFIGURED_FREQ_NUM; freqChIndex++)
        {
            ptrIdacMod[freqChIndex] = calMask;
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_IDAC_COMP_EN)
                ptrSnsCxt[freqChIndex * context->ptrCommonConfig->numSns].idacComp = calMask;
            #endif
        }

        modClkDivider = context->ptrCommonContext->modCsdClk;
        if (0u == modClkDivider)
        {
            modClkDivider = 1u;
        }

        isBusyWatchdogTimeUs  = (uint64_t)CY_CAPSENSE_CONFIGURED_FREQ_NUM * ptrWdCxt->maxRawCount;
        isBusyWatchdogTimeUs *= (uint64_t)modClkDivider * CY_CAPSENSE_CONVERSION_MEGA;
        isBusyWatchdogTimeUs /= context->ptrCommonConfig->periClkHz;

        if (0u == isBusyWatchdogTimeUs)
        {
            isBusyWatchdogTimeUs = 1u;
        }

