zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_csd_v2.c
    if (context->ptrCommonConfig->numWd <= widgetId)
    {
        calibrateStatus = CY_CAPSENSE_STATUS_BAD_PARAM;
    }

    if (CY_CAPSENSE_CSD_GROUP != context->ptrWdConfig[widgetId].senseMethod)
    {
        calibrateStatus = CY_CAPSENSE_STATUS_BAD_PARAM;
    }

    if (CY_CAPSENSE_BUSY == (context->ptrCommonContext->status & CY_CAPSENSE_BUSY))
    {
        /* Previous widget is being scanned, return error */
        calibrateStatus = CY_CAPSENSE_STATUS_INVALID_STATE;
    }

    if (CY_CAPSENSE_STATUS_SUCCESS == calibrateStatus)
    {
        ptrWdCfg = &context->ptrWdConfig[widgetId];
        ptrWdCfg->ptrWdContext->idacGainIndex = context->ptrCommonConfig->csdIdacGainInitIndex;

        /* Perform calibration */
        #if (CY_CAPSENSE_DISABLE == CY_CAPSENSE_CSD_IDAC_AUTO_GAIN_EN)
            Cy_CapSense_CSDCalibrate(widgetId, target, context);
        #else
            do
            {
                Cy_CapSense_CSDCalibrate(widgetId, target, context);
                gainSwitch = Cy_CapSense_CSDSwitchIdacGain(context);
            } while (0u != gainSwitch);
        #endif

        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_IDAC_COMP_EN)
            /* IDAC Normalization in Dual IDAC mode */
            Cy_CapSense_CSDNormalizeIdac(ptrWdCfg, target, context);
        #endif

        /* Perform specified widget scan to check calibration result */
        Cy_CapSense_CSDSetupWidget(widgetId, context);
        Cy_CapSense_CSDScan(context);

        modClkDivider = context->ptrCommonContext->modCsdClk;
        if (0u == modClkDivider)
        {
            modClkDivider = 1u;
        }

        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_FREQUENCY_SCAN_EN)
            isBusyWatchdogTimeUs  = (uint64_t)CY_CAPSENSE_MAX_SUPPORTED_FREQ_NUM * ptrWdCfg->numSns * ptrWdCfg->ptrWdContext->maxRawCount;
        #else
            isBusyWatchdogTimeUs  = (uint64_t)ptrWdCfg->numSns * ptrWdCfg->ptrWdContext->maxRawCount;
        #endif
        isBusyWatchdogTimeUs *= (uint64_t)modClkDivider * CY_CAPSENSE_CONVERSION_MEGA;
        isBusyWatchdogTimeUs /= context->ptrCommonConfig->periClkHz;

        if (0u == isBusyWatchdogTimeUs)
        {
            isBusyWatchdogTimeUs = 1u;
        }

        isBusyWatchdogTimeUs *= CY_CAPSENSE_CSD_WATCHDOG_MARGIN_COEFF;
        cpuFreqMHz = context->ptrCommonConfig->cpuClkHz / CY_CAPSENSE_CONVERSION_MEGA;
        watchdogCounter = Cy_CapSense_WatchdogCyclesNum((uint32_t)isBusyWatchdogTimeUs, cpuFreqMHz, isBusyLoopDuration);

        while (CY_CAPSENSE_BUSY == (context->ptrCommonContext->status & CY_CAPSENSE_BUSY))
        {
            if (0uL == watchdogCounter)
            {
                break;
            }
            watchdogCounter--;
        }

        /* Verification of calibration result */

        calibrateStatus = Cy_CapSense_CalibrateCheck(widgetId, target, CY_CAPSENSE_CSD_GROUP, context);
    }

    return calibrateStatus;
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) */


/*******************************************************************************
* Function Name: Cy_CapSense_CSDCmodPrecharge
****************************************************************************//**
*
* Initializes the Cmod charging to Vref.
*
* This function performs coarse initialization for Cmod and Csh.
* The coarse initialization is performed by HSCOMP.
* The HSCOMP monitors the Cmod voltage via Cmod sense path
* and charges the Cmod using HCAV switch via CSDBUS-A, AMUXBUS-A
* and static connection of Cmod to AMUXBUS-A.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CSDCmodPrecharge(cy_stc_capsense_context_t * context)
{
    uint32_t cpuFreqMHz;
    uint32_t watchdogCounter;

    /* Approximate duration of Wait For Init loop */
    const uint32_t intrInitLoopDuration = 5uL;

    /* Wait For Init watchdog timeout in microseconds */
    const uint32_t initWatchdogTimeUs = CY_CAPSENSE_CSD_PRECHARGE_WATCHDOG_TIME_US;

    /* Disable INIT interrupt */
    context->ptrCommonConfig->ptrCsdBase->INTR_MASK = CY_CAPSENSE_CSD_INTR_MASK_CLEAR_MSK;
    (void)context->ptrCommonConfig->ptrCsdBase->INTR_MASK;

    context->ptrCommonConfig->ptrCsdBase->HSCMP = context->ptrInternalContext->csdRegHscmpInit;
    context->ptrCommonConfig->ptrCsdBase->CSDCMP = CY_CAPSENSE_CSD_CSDCMP_CSDCMP_EN_MSK;

    context->ptrCommonConfig->ptrCsdBase->SW_RES = context->ptrInternalContext->csdRegSwResInit;
    context->ptrCommonConfig->ptrCsdBase->SW_FW_MOD_SEL = 0u;
    context->ptrCommonConfig->ptrCsdBase->SW_FW_TANK_SEL = 0u;

    #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN) && \
        (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_CAP_EN))
        context->ptrCommonConfig->ptrCsdBase->SW_SHIELD_SEL = CY_CAPSENSE_CSD_SW_SHIELD_SEL_SW_HCBV_HSCMP;
        context->ptrCommonConfig->ptrCsdBase->SW_HS_P_SEL = context->ptrInternalContext->csdRegSwHsPSelCtankInit;

        /* Start SEQUENCER for coarse initialization for Csh */
        context->ptrCommonConfig->ptrCsdBase->SEQ_START = CY_CAPSENSE_CSD_SEQ_START_SEQ_MODE_MSK |
                                                          CY_CAPSENSE_CSD_SEQ_START_START_MSK;
        /* Init Watchdog Counter to prevent a hang */
        cpuFreqMHz = context->ptrCommonConfig->cpuClkHz / CY_CAPSENSE_CONVERSION_MEGA;
        watchdogCounter = Cy_CapSense_WatchdogCyclesNum(initWatchdogTimeUs, cpuFreqMHz, intrInitLoopDuration);
        watchdogCounter = Cy_CapSense_WaitForSeqIdle(watchdogCounter, context);

        if (0u == watchdogCounter)
        {
            /* Set sequencer to idle state if coarse initialization fails */
            context->ptrCommonConfig->ptrCsdBase->SEQ_START = CY_CAPSENSE_CSD_SEQ_START_ABORT_MSK;
        }
    #endif

    context->ptrCommonConfig->ptrCsdBase->SW_HS_P_SEL = context->ptrInternalContext->csdRegSwHsPSelCmodInit;
    context->ptrCommonConfig->ptrCsdBase->SW_SHIELD_SEL = CY_CAPSENSE_CSD_SW_SHIELD_SEL_SW_HCAV_HSCMP;

    /* Start SEQUENCER for coarse initialization for Cmod */
    context->ptrCommonConfig->ptrCsdBase->SEQ_START = CY_CAPSENSE_CSD_SEQ_START_SEQ_MODE_MSK |
                                                      CY_CAPSENSE_CSD_SEQ_START_START_MSK;
    /* Init Watchdog Counter to prevent a hang */
    cpuFreqMHz = context->ptrCommonConfig->cpuClkHz / CY_CAPSENSE_CONVERSION_MEGA;
    watchdogCounter = Cy_CapSense_WatchdogCyclesNum(initWatchdogTimeUs, cpuFreqMHz, intrInitLoopDuration);
    watchdogCounter = Cy_CapSense_WaitForSeqIdle(watchdogCounter, context);

