zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_csd_v2.c
        Cy_CapSense_CSDCalculateScanDuration(context);
        Cy_CapSense_CSDConfigClock(context);
        Cy_CapSense_CSDConnectSnsExt(context);
        Cy_CapSense_CSDSetUpIdacs(context);

        Cy_CapSense_CSDStartSample(context);
    }
    else
    {
        if (0u != (ptrActive->scanScope & CY_CAPSENSE_SCAN_SCOPE_ALL_WD_MASK))
        {
            /* Configure and begin scanning next widget */
            Cy_CapSense_SsPostAllWidgetsScan(context);
        }
        else
        {
            /* All the widgets are scanned */
            Cy_CapSense_ClrBusyFlags(context);
        }
    }
}


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_FREQUENCY_SCAN_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_CSDInitNextChScan
****************************************************************************//**
*
* This function initializes the next frequency of the sensor scan.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_CSDInitNextChScan(cy_stc_capsense_context_t * context)
{
    cy_stc_capsense_active_scan_sns_t * ptrActive = context->ptrActiveScanSns;

    ptrActive->mfsChannelIndex++;
    ptrActive->ptrSnsContext += context->ptrCommonConfig->numSns;

    Cy_CapSense_CSDChangeClkFreq((uint32_t)ptrActive->mfsChannelIndex, context);
    Cy_CapSense_CSDSetUpIdacs(context);
    Cy_CapSense_CSDStartSample(context);
}



/*******************************************************************************
* Function Name: Cy_CapSense_CSDChangeClkFreq
****************************************************************************//**
*
*  This function changes the sensor clock frequency by configuring
*  the corresponding divider.
*
* \param channelIndex
*  The frequency channel index.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
__STATIC_INLINE void Cy_CapSense_CSDChangeClkFreq(uint32_t channelIndex, cy_stc_capsense_context_t * context)
{
    const cy_stc_capsense_widget_context_t * ptrWdCxt = context->ptrActiveScanSns->ptrWdContext;
    uint32_t snsClkDivider;
    uint32_t snsClkSrc = (uint32_t)ptrWdCxt->snsClkSource & ((uint32_t)~(uint32_t)CY_CAPSENSE_CLK_SOURCE_AUTO_MASK);
    uint32_t regValue = 0u;
    uint32_t freqOffset;
    uint32_t conversionsNum;

    /* Getting row clock divider for matrix buttons or touchpad widgets */
    if (context->ptrActiveScanSns->ptrWdConfig->numCols <= context->ptrActiveScanSns->sensorIndex)
    {
        snsClkDivider = ptrWdCxt->rowSnsClk;
    }
    else
    {
        snsClkDivider = ptrWdCxt->snsClk;
    }

    /* Change the divider based on the chId */
    switch (channelIndex)
    {
        case CY_CAPSENSE_MFS_CH1_INDEX:
        {
            freqOffset = context->ptrCommonConfig->csdMfsDividerOffsetF1;
            break;
        }
        case CY_CAPSENSE_MFS_CH2_INDEX:
        {
            freqOffset = context->ptrCommonConfig->csdMfsDividerOffsetF2;
            break;
        }
        default:
        {
            freqOffset = 0u;
            break;
        }
    }

    if ((CY_CAPSENSE_CLK_SOURCE_PRS8 == snsClkSrc) || (CY_CAPSENSE_CLK_SOURCE_PRS12 == snsClkSrc))
    {
        freqOffset <<= 1uL;
    }

    snsClkDivider += freqOffset;

    /* Set Number Of Conversions based on scanning resolution */
    conversionsNum = Cy_CapSense_CSDGetNumberOfConversions(snsClkDivider, (uint32_t)ptrWdCxt->resolution, (uint32_t)snsClkSrc);
    context->ptrCommonConfig->ptrCsdBase->SEQ_NORM_CNT = (conversionsNum & CY_CAPSENSE_CSD_SEQ_NORM_CNT_CONV_CNT_MSK);

    /* Configuring PRS SEL_BIT  and decreasing divider in case of PRS */
    if ((CY_CAPSENSE_CLK_SOURCE_PRS8 == snsClkSrc) || (CY_CAPSENSE_CLK_SOURCE_PRS12 == snsClkSrc))
    {
        regValue = CY_CAPSENSE_CSD_SENSE_PERIOD_SEL_LFSR_MSB_MSK;
        snsClkDivider >>= 1u;
    }

    /* Check divider value */
    if (0u == snsClkDivider)
    {
        snsClkDivider = 1u;
    }

    regValue |= ((snsClkSrc << CY_CAPSENSE_CSD_SENSE_PERIOD_LFSR_SIZE_POS) | (snsClkDivider - 1u));

    /* Update reg value with divider and configuration */
    context->ptrCommonConfig->ptrCsdBase->SENSE_PERIOD = regValue;
}
#endif

#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) */

#endif /* (defined(CY_IP_MXCSDV2) || defined(CY_IP_M0S8CSDV2)) */


/* [] END OF FILE */
